In [1]:
import pandas as pd
df=pd.read_csv("empdata.csv")
df

   Empid           Ename    Salary         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [3]:
df.columns = [i.upper() for i in df]
print(df.columns)

Index(['EMPID', 'ENAME', 'SALARY', 'DOJ'], dtype='object')

In [5]:
df.isna().sum()

EMPID     0
ENAME     0
SALARY    1
DOJ       0
dtype: int64

In [7]:
df.isnull().sum()

EMPID     0
ENAME     0
SALARY    1
DOJ       0
dtype: int64

In [9]:
print(df.isnull())

   EMPID  ENAME  SALARY    DOJ
0  False  False   False  False
1  False  False   False  False
2  False  False    True  False
3  False  False   False  False
4  False  False   False  False
5  False  False   False  False

In [11]:
df

   EMPID           ENAME    SALARY         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [13]:
print(df.isna().sum())

EMPID     0
ENAME     0
SALARY    1
DOJ       0
dtype: int64

In [15]:
print(df.dropna(axis=0,inplace=False))

   EMPID           ENAME    SALARY         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999

In [17]:
print(df)

   EMPID           ENAME    SALARY         DOJ
0   1001          Ganesh   1000.00  10-10-2000
1   1002            Anil  23000.50   3/20/2002
2   1003          Gaurav       NaN  03-03-2002
3   1004    Hema Chandra  16500.50  09-10-2000
4   1005  Laxmi Prasanna  12000.75  10-08-2000
5   1006          Anant    9999.99  09-09-1999